In [110]:
import pandas as pd
import numpy as np
from sklearn.metrics.pairwise import cosine_similarity
from metric import recall5

In [111]:
apply_train_df = pd.read_csv('apply_train.csv')
print(len(apply_train_df.resume_seq.unique()))
print(len(apply_train_df.recruitment_seq.unique()))
apply_train_df.sort_values(['resume_seq','recruitment_seq']).reset_index(drop=True)

8482
6695

      resume_seq recruitment_seq
0         U00001          R04536
1         U00001          R05210
2         U00001          R05288
3         U00001          R06065
4         U00002          R01103
...          ...             ...
57941     U08481          R05500
57942     U08481          R06253
57943     U08482          R03633
57944     U08482          R03743
57945     U08482          R06282

[57946 rows x 2 columns]

In [112]:
pd.DataFrame(apply_train_df.groupby('recruitment_seq'))[1][0]

      resume_seq recruitment_seq
1007      U04614          R00001
3577      U01670          R00001
4511      U04364          R00001
4827      U06166          R00001
12883     U06181          R00001
13507     U08247          R00001
19619     U06543          R00001
40253     U04491          R00001
41726     U05502          R00001
42096     U04097          R00001
45925     U03957          R00001

In [118]:
# 사용자-아이템 행렬 생성: 구직자가 해당 채용 공고에 지원했으면 1, 아니면 0으로 설정
user_item_matrix = apply_train_df.groupby(['resume_seq', 'recruitment_seq']).size().unstack(fill_value=0)
# user_item_matrix[user_item_matrix > 1] = 1

# 사용자 간의 유사성 계산
user_similarity = cosine_similarity(user_item_matrix) # x, yT

# 추천 점수 계산
user_predicted_scores = user_similarity.dot(user_item_matrix) / np.array([np.abs(user_similarity).sum(axis=1)]).T

In [119]:
user_similarity.shape, user_item_matrix.shape, user_predicted_scores.shape

((8482, 8482), (8482, 6695), (8482, 6695))

In [126]:
apply_train_df.groupby(['resume_seq', 'recruitment_seq']).size().unstack(fill_value=0)

recruitment_seq,R00001,R00002,R00003,R00004,R00005,R00006,R00007,R00008,R00009,R00010,...,R06686,R06687,R06688,R06689,R06690,R06691,R06692,R06693,R06694,R06695
resume_seq,,,,,,,,,,,,,,,,,,,,,
U00001,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U00002,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U00003,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U00004,0,0,0,1,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U00005,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
U08478,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U08479,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U08480,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U08481,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0
U08482,0,0,0,0,0,0,0,0,0,0,...,0,0,0,0,0,0,0,0,0,0

In [49]:
pd.read_csv('./company.csv') # r
pd.read_csv('./recruitment.csv') # r
pd.read_csv('./resume.csv') # u
pd.read_csv('./resume_certificate.csv') # u
pd.read_csv('./resume_education.csv') # u
pd.read_csv('./resume_language.csv') # u

    resume_seq  language  exam_name   score
0       U01774         2          4  742.42
1       U04892         2          4  888.89
2       U01859         2          4  500.00
3       U02475         2          4  500.00
4       U03776         4          5  595.96
..         ...       ...        ...     ...
864     U04964         2         11  400.00
865     U02950         2          4  843.43
866     U05922         2          2  500.00
867     U03827         2          4  883.84
868     U04680         2          4  666.67

[869 rows x 4 columns]

In [96]:
print(len(pd.read_csv('./company.csv'))) # r
print(len(pd.read_csv('./recruitment.csv'))) # r

r = pd.merge(pd.read_csv('./recruitment.csv'),pd.read_csv('./company.csv'),how='left').sort_values('recruitment_seq').reset_index(drop=True)
[i.split(';') for i in r['check_box_keyword']]
r

2377
6695

,recruitment_seq,address_seq1,address_seq2,address_seq3,career_end,career_start,check_box_keyword,education,major_task,qualifications,text_keyword,company_type_seq,supply_kind,employee
0,R00001,5.0,NaN,NaN,0,0,2101;2108;2201;2204;2205;2707;2810,2,2,1,NaN,5.0,201.0,631.0
1,R00002,3.0,NaN,NaN,0,0,2507;2703;2707,3,2,1,NaN,2.0,201.0,160.0
2,R00003,3.0,NaN,NaN,0,0,2101;2108;2201;2707,3,2,2,NaN,NaN,NaN,NaN
3,R00004,3.0,NaN,NaN,0,0,2507;2707,3,2,1,NaN,2.0,402.0,500.0
4,R00005,3.0,NaN,NaN,0,0,2507;2707,3,2,1,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
6690,R06691,3.0,NaN,NaN,0,0,2501;2507;2707,3,2,1,NaN,NaN,NaN,NaN
6691,R06692,3.0,NaN,NaN,0,0,2201;2507,3,2,2,NaN,4.0,402.0,150.0
6692,R06693,5.0,NaN,NaN,0,0,2102;2707,4,2,1,NaN,NaN,NaN,NaN
6693,R06694,3.0,NaN,NaN,0,0,2101;2108;2109;2110;2201;2203;2707,4,2,1,NaN,NaN,NaN,NaN
6694,R06695,3.0,NaN,NaN,0,0,2507;2707,3,2,1,NaN,NaN,NaN,NaN

In [59]:
pd.read_csv('./resume.csv')
pd.read_csv('./resume_certificate.csv')
pd.read_csv('./resume_education.csv')
pd.read_csv('./resume_language.csv')
print(len(pd.read_csv('./resume.csv')))
print(len(pd.read_csv('./resume_certificate.csv')))
print(len(pd.read_csv('./resume_education.csv')))
print(len(pd.read_csv('./resume_language.csv')))

8482
12975
8482
869

In [64]:
pd.merge(pd.read_csv('./resume.csv'),pd.read_csv('./resume_education.csv')).info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 8482 entries, 0 to 8481
Data columns (total 26 columns):
 #   Column                 Non-Null Count  Dtype
---  ------                 --------------  -----
 0   resume_seq             8482 non-null   object
 1   reg_date               8482 non-null   object
 2   updated_date           8482 non-null   object
 3   degree                 8482 non-null   int64
 4   graduate_date          8482 non-null   int64
 5   hope_salary            8482 non-null   float64
 6   last_salary            8482 non-null   float64
 7   text_keyword           8287 non-null   object
 8   job_code_seq1          8482 non-null   object
 9   job_code_seq2          500 non-null    object
 10  job_code_seq3          187 non-null    object
 11  career_month           8482 non-null   int64
 12  career_job_code        7724 non-null   object
 13  hischool_type_seq      8482 non-null   int64
 14  hischool_special_type  8482 non-null   object
 15  hischool_nation        8482 non-null   object
 16  hischool_gender        8482 non-null   object
 17  hischool_location_seq  8482 non-null   int64
 18  univ_type_seq1         8482 non-null   int64
 19  univ_type_seq2         8482 non-null   int64
 20  univ_transfer          8482 non-null   int64
 21  univ_location          8482 non-null   int64
 22  univ_major             1795 non-null   object
 23  univ_sub_major         416 non-null    object
 24  univ_major_type        8482 non-null   int64
 25  univ_score             8482 non-null   float64
dtypes: float64(3), int64(10), object(13)
memory usage: 1.7+ MB

In [78]:
pd.DataFrame(pd.read_csv('./resume_certificate.csv').groupby('resume_seq'))[1][2]

     resume_seq   certificate_contents
905      U00004               유통관리사 2급
1509     U00004                정보처리기능사
3524     U00004  MOS EXCEL 2003 EXPERT

In [276]:
from sklearn.preprocessing import MinMaxScaler
from sklearn.decomposition import PCA
import seaborn as sns

udata = pd.read_csv('./resume.csv')
# udata = pd.merge(udata,pd.read_csv('./resume_certificate.csv'),how='left')
droping = ['reg_date','updated_date','graduate_date','job_code_seq2','job_code_seq3']
udata = udata.drop(droping,axis=1)

encoding = ['text_keyword','job_code_seq1','career_job_code'] # + certify encoding
udata = udata.drop(encoding,axis=1)

mg = pd.read_csv('./resume_certificate.csv').groupby('resume_seq').count().reset_index()
udata = pd.merge(udata,mg,how='left').fillna(0)
mg = pd.read_csv('./resume_language.csv').loc[:,['resume_seq','language']].groupby('resume_seq').count().reset_index()
udata = pd.merge(udata,mg,how='left').fillna(0)


# Initialize the MinMaxScaler
scaler = MinMaxScaler()

# Fit and transform the data
for i in udata.columns[1:]:
    scaled_data = scaler.fit_transform(np.array(udata[i]).reshape(-1,1))
    udata[i] = scaled_data
    
# sns.heatmap(udata.corr())

n_components = 2  # Number of principal components to keep
pca = PCA(n_components)
principal_components = pca.fit_transform(udata.iloc[:,1:])

scaled_udata = udata['resume_seq']
udata = pd.concat([scaled_udata,pd.DataFrame(principal_components,columns=['pca1','pca2'])],axis=1)

udata

     resume_seq      pca1      pca2
0        U00606  0.209503  0.070064
1        U00509  0.069493 -0.241749
2        U02012  0.206703  0.090490
3        U04599 -0.139470 -0.019403
4        U07573 -0.229207  0.170333
...         ...       ...       ...
8477     U04890  0.353037 -0.362741
8478     U05910 -0.116491  0.290338
8479     U01468 -0.307805 -0.022561
8480     U05315 -0.290986 -0.037922
8481     U01277 -0.123945  0.115736

[8482 rows x 3 columns]

In [277]:
pd.merge(apply_train_df,udata)

      resume_seq recruitment_seq      pca1      pca2
0         U05833          R03838  0.381804  0.131055
1         U05833          R00999  0.381804  0.131055
2         U05833          R03978  0.381804  0.131055
3         U05833          R02932  0.381804  0.131055
4         U06456          R02144  0.178857  0.108696
...          ...             ...       ...       ...
57941     U01026          R01783 -0.313013  0.011082
57942     U05390          R01081 -0.210092 -0.140691
57943     U05390          R02825 -0.210092 -0.140691
57944     U05310          R01365 -0.052976 -0.170170
57945     U05310          R03734 -0.052976 -0.170170

[57946 rows x 4 columns]

In [243]:
pd.read_csv('./resume_certificate.csv')

      resume_seq certificate_contents
0         U06421                손해보험사
1         U01278              2종운전면허증
2         U01008        자동차운전면허 2종 보통
3         U03248             운전면허2종보통
4         U07483               메이크업3급
...          ...                  ...
12970     U07453            컬러리스트산업기사
12971     U06358         컴퓨터그래픽스운용기능사
12972     U03248            수치제어밀링기능사
12973     U08157                 주산2급
12974     U02889             유통관리사 2급

[12975 rows x 2 columns]